ycsb-results/mongodb/d/rc50-op25/tc1/run3.txt
/usr/bin/java  -classpath /home/atz2nd/Desktop/editycsb/YCSB/conf:/home/atz2nd/Desktop/editycsb/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://127.0.0.1:27017 -P /home/atz2nd/Desktop/editycsb/YCSB/workloads/workloadd -p recordcount=50 -threads 1 -p operationcount=25
mongo client connection created with mongodb://127.0.0.1:27017
[OVERALL], RunTime(ms), 455
[OVERALL], Throughput(ops/sec), 54.94505494505494
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 4
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.8791208791208791
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 4
[TOTAL_GC_TIME_%], Time(%), 0.8791208791208791
[READ], Operations, 24
[READ], AverageLatency(us), 1378.0833333333333
[READ], MinLatency(us), 762
[READ], MaxLatency(us), 11519
[READ], 95thPercentileLatency(us), 1322
[READ], 99thPercentileLatency(us), 11519
[READ], Return=OK, 24
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1608.0
[CLEANUP], MinLatency(us), 1608
[CLEANUP], MaxLatency(us), 1608
[CLEANUP], 95thPercentileLatency(us), 1608
[CLEANUP], 99thPercentileLatency(us), 1608
[INSERT], Operations, 1
[INSERT], AverageLatency(us), 47824.0
[INSERT], MinLatency(us), 47808
[INSERT], MaxLatency(us), 47839
[INSERT], 95thPercentileLatency(us), 47839
[INSERT], 99thPercentileLatency(us), 47839
[INSERT], Return=OK, 1